In [1]:
import pandas as pd

C:\Users\admin\AppData\Local\Temp\ipykernel_12532\2035458946.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
book1=pd.read_excel('Book1.xlsx')

In [3]:
book1.columns

Index(['state'], dtype='object')

In [4]:
book1

       state
0  tamilnadu
1  karnataka
2        goa
3     kerala

In [5]:
book2=pd.read_excel('Book2.xlsx')

In [6]:
book2

      state
0  tamilnadu
1      andra
2      delhi

In [7]:
book1=pd.get_dummies(book1,drop_first=True)

In [8]:
book1

   state_karnataka  state_kerala  state_tamilnadu
0            False         False             True
1             True         False            False
2            False         False            False
3            False          True            False

In [9]:
book2=pd.get_dummies(book2,drop_first=True)

In [10]:
book2

   state _delhi  state _tamilnadu
0         False              True
1         False             False
2          True             False